Table of Contents
 Class CrossSection
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
Cross-section
public abstract class CrossSection : OpenElementId
Inheritance
object
OpenObject
OpenElementId
CrossSection
Derived
CrossSectionComponent
CrossSectionGeneralColdFormed
CrossSectionParameter
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 CrossSection()
Constructor
public CrossSection()
Properties
 CrossSectionRotation
Rotation of Cross - Section
public double CrossSectionRotation { get; set; }
Property Value
double
 IsInPrincipal
Specifies that the cross-section is in its principal axis.
public bool IsInPrincipal { get; set; }
Property Value
bool
 Name
Name of cross-section
public string Name { get; set; }
Property Value
string
 Edit this page